# DATA PREPROCESSING
## 데이터 구조 점검 - 1

In [ ]:
# 데이터 전처리

from hossam import load_data
from pandas import CategoricalDtype # (명목형 타입을 가져오는 클래스)

In [2]:
origin = load_data('grade')
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### 데이터 확인하기

In [4]:
# 데이터 크기

rows, cols = origin.shape
print('%d행, %d열의 %d차원 데이터' % (rows, cols, origin.ndim))

9행, 6열의 2차원 데이터

### 데이터 타입 변경

In [5]:
# 컬럼 단위 변경
# 작업을 위한 복사본 생성(아주 중요한 개념)

컬럼타입변경df = origin.copy()
컬럼타입변경df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 504.0+ bytes

In [6]:
# 컬럼 단위 변경

컬럼타입변경df['국어'] = 컬럼타입변경df['국어'].astype('float')
컬럼타입변경df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      float64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: float64(1), int64(4), object(1)
memory usage: 804.0+ bytes

In [7]:
# 타입 일괄 변경 후 DataFrame 리턴 받기

타입변환df = origin.astype({'국어':'float', '영어': 'float',
                            '수학': 'str', '과학': 'bool'})
타입변환df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      float64
 3   영어      9 non-null      float64
 4   수학      9 non-null      object
 5   과학      9 non-null      bool
dtypes: bool(1), float64(2), int64(1), object(2)
memory usage: 741.0+ bytes

In [8]:
# 타입 일괄 변경 후 원본 확인

origin.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 804.0+ bytes

In [9]:
# 범주형 데이터를 명목척도로 변환
# 컬럼 단위 변환

컬럼단위_명목df = origin.copy()
컬럼단위_명목df['학년'] = 컬럼단위_명목df['학년'].astype('category')
컬럼단위_명목df['성별'] = 컬럼단위_명목df['성별'].astype('category')
컬럼단위_명목df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      category
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(2), int64(4)
memory usage: 1006.0+ bytes

In [11]:
# 범주형 데이터를 명목척도로 변환
# 복사본 리턴 받기

범주형df = origin.astype({'학년': 'category', '성별': 'category'})
범주형df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      category
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(2), int64(4)
memory usage: 1006.0+ bytes

In [12]:
# 범주형 데이터를 서열척도로 변환
# 컬럼 단위로 적용하여 원본에 직접 적용하기

컬럼단위_서열척도df = origin.copy()
컬럼단위_서열척도df['학년'] = 컬럼단위_서열척도df['학년'].astype(
    CategoricalDtype(categories = [1,2,3,4], ordered = True))
컬럼단위_서열척도df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(1), int64(4), object(1)
memory usage: 945.0+ bytes

In [14]:
# 서열척도로 변환 후 복사본 리턴 
서열척도df = origin.astype({
    '학년': CategoricalDtype(categories = [1, 2, 3, 4], ordered = True)})
서열척도df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(1), int64(4), object(1)
memory usage: 945.0+ bytes

### 행, 열의 이름 변경

In [ ]:
# rename() 매서드의 이용
# 기존이름: 딕셔너리로 지정
# columns와 index 중 변경을 원하는 파라미터 하나만 설정 가능
# 원본 변화 없음.
# 이름 변경되지 않은 항목이 결과에서 제외되지는 않는다
이름변경df = origin.rename(
    columns = {'국어': 'kor', '영어': 'eng', '수학': 'math', '과학': 'sci'},
    index = {'석영': 'suk', '호영': 'ho', '민철': 'min', '수현': 'su'}
)
이름변경df

     학년  성별  kor  eng  math  sci
이름
철수    1  남자   98   77    88   64
영희    2  여자   88  120    62   72
min   1  남자   92   70    83   79
su    3  여자   63   60    31   71
ho    4  남자   75   50    90   88
영호    4  남자   80   88    91   72
용식    2  남자   82   88    79   90
나영    1  여자   90   92    81   95
suk   1  남자   91   90    89   80

### 연습문제

In [20]:
origin = load_data('fruit_shop')
origin

[data] https://data.hossam.kr/data/lab03/fruit_shop.xlsx
[desc] 어느 과일 가게의 매출을 정리한 가상의 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

    판매일   과일 등급    가격  Num_Sold
0     1   사과  A  1500        10
1     1  바나나  B  1000        15
2     1   사과  B  1200         5
3     2  복숭아  A  2500         8
4     2  바나나  A  1200        12
5     2   사과  C  1000        20
6     3   사과  A  1500        12
7     3  복숭아  B  2200        10
8     3  바나나  B  1000        18
9     4  바나나  A  1200        20
10    4   사과  B  1200        11
11    4  복숭아  A  2500        15

In [21]:
# 행 열 
rows, cols = origin.shape
print('%d 행 %d 열 %d 차원' % (rows, cols, origin.ndim))

12 행 5 열 2 차원

In [22]:
# 컬럼 단위 변경
# 작업을 위한 복사본 생성(아주 중요한 개념)

컬럼타입변경df = origin.copy()
컬럼타입변경df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   판매일       12 non-null     int64
 1   과일        12 non-null     object
 2   등급        12 non-null     object
 3   가격        12 non-null     int64
 4   Num_Sold  12 non-null     int64
dtypes: int64(3), object(2)
memory usage: 612.0+ bytes

In [ ]:
이름변경df = origin.rename(
    columns = {'Num_Sold': '판매량'}
)
이름변경df

    판매일   과일 등급    가격  판매량
0     1   사과  A  1500   10
1     1  바나나  B  1000   15
2     1   사과  B  1200    5
3     2  복숭아  A  2500    8
4     2  바나나  A  1200   12
5     2   사과  C  1000   20
6     3   사과  A  1500   12
7     3  복숭아  B  2200   10
8     3  바나나  B  1000   18
9     4  바나나  A  1200   20
10    4   사과  B  1200   11
11    4  복숭아  A  2500   15

In [64]:
# 범주형 데이터를 명목척도로 변환
# 컬럼 단위 변환

컬럼단위_명목df = origin.copy()
컬럼단위_명목df['과일'] = 컬럼단위_명목df['과일'].astype('category')
컬럼단위_명목df['등급'] = 컬럼단위_명목df['등급'].astype('category')
컬럼단위_명목df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   판매일     12 non-null     int64
 1   과일      12 non-null     category
 2   등급      12 non-null     category
 3   가격      12 non-null     int64
 4   판매량     12 non-null     int64
dtypes: category(2), int64(3)
memory usage: 708.0 bytes

In [65]:
서열척도df = origin.astype({
    '등급': CategoricalDtype(categories = ['A', 'B', 'C'], ordered = True)})
서열척도df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   판매일     12 non-null     int64
 1   과일      12 non-null     object
 2   등급      12 non-null     category
 3   가격      12 non-null     int64
 4   판매량     12 non-null     int64
dtypes: category(1), int64(3), object(1)
memory usage: 660.0+ bytes

### 연습문제 - 2

In [71]:
from pandas import DataFrame

data = {
    'class': ['A1','A1','A1','A1','A1',
              'A2','A2','A2','A2','A2','A2',
              'A3','A3','A3','A3','A3','A3','A3',
              'A4','A4','A4','A4','A4','A4','A4'],
    'time':[62, 60, 63, 59, 61,
            62, 67, 71, 64, 65, 66,
            68, 66, 71, 67, 68, 69, 70,
            58, 62, 60, 59, 61, 63, 64]
}

df = DataFrame(data)
df

   class  time
0     A1    62
1     A1    60
2     A1    63
3     A1    59
4     A1    61
5     A2    62
6     A2    67
7     A2    71
8     A2    64
9     A2    65
10    A2    66
11    A3    68
12    A3    66
13    A3    71
14    A3    67
15    A3    68
16    A3    69
17    A3    70
18    A4    58
19    A4    62
20    A4    60
21    A4    59
22    A4    61
23    A4    63
24    A4    64

In [76]:
df2 = df.astype({'class': 'category'})
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   class   25 non-null     category
 1   time    25 non-null     int64
dtypes: category(1), int64(1)
memory usage: 561.0 bytes